app/views/public_recipes/index.html.erb

        <div class="items">
          <% @recipe_foods = RecipeFood.joins(food: :user, new_recipe: :user).where(foods: { user_id: recipe.user_id }, new_recipes: { user_id: recipe.user_id }) %>
---
SELECT SUM(foods.quantity * foods.price) FROM "recipe_foods" INNER JOIN "foods" ON "foods"."id" = "recipe_foods"."food_id" INNER JOIN "users" ON "users"."id" = "foods"."user_id" INNER JOIN "new_recipes" ON "new_recipes"."id" = "recipe_foods"."new_recipe_id" INNER JOIN "users" "users_new_recipes" ON "users_new_recipes"."id" = "new_recipes"."user_id" WHERE "foods"."user_id" = $1 AND "new_recipes"."user_id" = $2 AND "recipe_foods"."recipe_id" = $3  [["user_id", 33], ["user_id", 33], ["recipe_id", 14]]