app/controllers/new_recipes_controller.rb

SELECT "new_recipes".* FROM "new_recipes" WHERE "new_recipes"."user_id" = $1  [["user_id", 1]]
---
  def index
    @recipes = NewRecipe.where(user_id: current_user.id)

SELECT "new_recipes".* FROM "new_recipes" WHERE "new_recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @recipe = NewRecipe.find(params[:id])

SELECT "new_recipes".* FROM "new_recipes" WHERE "new_recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_recipe
    @recipe = NewRecipe.find(params[:id])