app/controllers/public_recipes_controller.rb

  def index
    @public_recipes = NewRecipe.where(public: true)
---
SELECT "new_recipes".* FROM "new_recipes" WHERE "new_recipes"."public" = $1  [["public", true]]