app/controllers/shopping_list_controller.rb

SELECT recipe_foods.*, foods.price * recipe_foods.quantity AS total_price, "recipe_foods"."id" AS t0_r0, "foods"."id" AS t1_r0, "foods"."user_id" AS t1_r1, "foods"."name" AS t1_r2, "foods"."measurement_unit" AS t1_r3, "foods"."price" AS t1_r4, "foods"."quantity" AS t1_r5, "foods"."created_at" AS t1_r6, "foods"."updated_at" AS t1_r7, "new_recipes"."id" AS t2_r0, "new_recipes"."name" AS t2_r1, "new_recipes"."preparation_time" AS t2_r2, "new_recipes"."cooking_time" AS t2_r3, "new_recipes"."description" AS t2_r4, "new_recipes"."public" AS t2_r5, "new_recipes"."user_id" AS t2_r6, "new_recipes"."created_at" AS t2_r7, "new_recipes"."updated_at" AS t2_r8 FROM "recipe_foods" INNER JOIN "foods" ON "foods"."id" = "recipe_foods"."food_id" LEFT OUTER JOIN "new_recipes" ON "new_recipes"."id" = "recipe_foods"."new_recipe_id"
---
  def index
    # Get all recipe foods including associated food items and their quantities
    @recipe_foods = RecipeFood.includes(:food, :new_recipe)
      .select('recipe_foods.*, foods.price * recipe_foods.quantity AS total_price')
      .joins(:food)
      .all

    # Calculate the total quantity of each food item needed for the recipe
    @recipe_quantities = Hash.new(0)
    @recipe_foods.each do |item|