app/views/new_recipes/_ingredient.html.erb

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]
---
            <%= f.label :food_id, "Food", class: "form-label" %>
            <%= f.select :food_id, current_user.foods.map { |food| [food.name, food.id] }, {}, class: "form-select" %>