app/views/new_recipes/show.html.erb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."new_recipe_id" = $1  [["new_recipe_id", 2]]
---
          <tbody class="text-gray-600 text-sm font-light">
            <% @recipe.recipe_foods.each do |recipe| %>